In [112]:
import pandas as pd

In [113]:
data = pd.read_csv('test (1).csv')

In [114]:
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [115]:
data.shape

(418, 11)

In [116]:
data.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [117]:
data.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [118]:
data.Embarked.value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

6 константных, 5 уникальных

In [119]:
data = data.drop(['Name', 'PassengerId', 'Cabin', 'Ticket'], axis=1)

In [120]:
data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [121]:
data.Age = data.Age.fillna(data.Age.mean())
data.head(5)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [122]:
data.Age = 1912-data.Age
data = data.astype({'Age':'int'})
data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  1877      0      0   7.8292        Q
1       3  female  1865      1      0   7.0000        S
2       2    male  1850      0      0   9.6875        Q
3       3    male  1885      0      0   8.6625        S
4       3  female  1890      1      1  12.2875        S

In [140]:
data = data.rename(columns = {'Pclass':'Класс', 'Sex':'Пол', 'Age': 'Возраст', 'SibSp': 'СибСп', 'Parch': 'Парч', 'Fare': 'Фаре', 'Embarked': 'Эмбаркед'})

In [141]:
data.isna().sum()

Класс       0
Пол         0
Возраст     0
СибСп       0
Парч        0
Фаре        1
Эмбаркед    0
dtype: int64

In [144]:
data['Фаре'] = data['Фаре'].fillna(data['Фаре'].mean())

In [145]:
data.isna().sum()

Класс       0
Пол         0
Возраст     0
СибСп       0
Парч        0
Фаре        0
Эмбаркед    0
dtype: int64

In [152]:
import openpyxl
data.to_excel("Laba_01_Pandas.xlsx")

In [153]:
data_xls = pd.read_excel('Laba_01_Pandas.xlsx')
data_xls.head(5)

   Unnamed: 0  Класс     Пол  Возраст  СибСп  Парч     Фаре Эмбаркед
0           0      3    male     1877      0     0   7.8292        Q
1           1      3  female     1865      1     0   7.0000        S
2           2      2    male     1850      0     0   9.6875        Q
3           3      3    male     1885      0     0   8.6625        S
4           4      3  female     1890      1     1  12.2875        S